taskt/Core/Automation/Commands/WebBrowserGroup/ISeleniumExecuteJavaScriptProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumExecuteJavaScriptProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands" [ label="ASeleniumExecuteJavaScriptCommands", style="dashed", ];
"taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumExecuteJavaScriptProperties" [ label="ISeleniumExecuteJavaScriptProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromFileCommand" [ label="SeleniumBrowserExecuteJavaScriptFromFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromCodeCommand" [ label="SeleniumBrowserExecuteJavaScriptFromCodeCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumExecuteJavaScriptProperties";
"taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromFileCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromCodeCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands";
}
